In [1]:
import pandas as pd
import numpy as np

# Arithmetic Operations

In [2]:
Series1 = pd.Series([50,60,70,80], index=['e','f','g','h'])
Series1

e    50
f    60
g    70
h    80
dtype: int64

In [3]:
Series2 = pd.Series([20,30,40,60], index=['h','g','f','e'])
Series2

h    20
g    30
f    40
e    60
dtype: int64

In [4]:
Series1 + Series2

e    110
f    100
g    100
h    100
dtype: int64

In [5]:
Series3 = pd.Series([10,20,30,50], index=['a','b','c','d'])
Series3

a    10
b    20
c    30
d    50
dtype: int64

In [6]:
Series4 = pd.Series([60,70,80,90], index=['b','c','d','e'])
Series4

b    60
c    70
d    80
e    90
dtype: int64

In [7]:
Series3 + Series4

a      NaN
b     80.0
c    100.0
d    130.0
e      NaN
dtype: float64

In [8]:
# Series objects with duplicated labels
Series5 = pd.Series([10,20,30],index=['x','x','y'])
Series5

x    10
x    20
y    30
dtype: int64

In [9]:
Series6 = pd.Series([40,50,60], index=['x','x','z'])
Series6

x    40
x    50
z    60
dtype: int64

Here duplicates will add separately. So x in Series5 will add separately to two x in Series6.

In [10]:
Series5 + Series6

x    50.0
x    60.0
x    60.0
x    70.0
y     NaN
z     NaN
dtype: float64

In [11]:
Series3

a    10
b    20
c    30
d    50
dtype: int64

In [12]:
Series3 * 10

a    100
b    200
c    300
d    500
dtype: int64

# Re-indexing Series

In [13]:
Series1 = pd.Series([10,20,30,40,50])
Series1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [14]:
Series1.index = ['p','q','r','s','t']
Series1

p    10
q    20
r    30
s    40
t    50
dtype: int64

If number of indices not equal to rows, exception(ValueError).

In [17]:
try:
    Series1.index = ['p','q','r','s']
    Series1
except Exception as e:
    print(e)

Length mismatch: Expected axis has 5 elements, new values have 4 elements

In [18]:
Series3 = Series1.reindex(['a','b','c','d','e'])
Series3

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [19]:
Series3 = Series1.reindex(['p','q','c','d','e'])
Series3

p    10.0
q    20.0
c     NaN
d     NaN
e     NaN
dtype: float64

In [20]:
Series5 = pd.Series([10,20,30], index=['1','3','5'])
Series5

1    10
3    20
5    30
dtype: int64

In [21]:
Series5.index = Series5.index.values.astype(int)

In [22]:
Series5

1    10
3    20
5    30
dtype: int64

In [23]:
Series5.describe()

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [24]:
Series5.index.dtype

dtype('int64')

# Slicing Series

Maximum grade is 100. But below Smith has 200 which is a mistake.

In [25]:
# Creating new series
grades = pd.Series([49,200,30,45], index=['john','smith','miller','jack'])
grades

john       49
smith     200
miller     30
jack       45
dtype: int64

In [26]:
# Correcting a value in the Series
grades['smith'] = 46
grades

john      49
smith     46
miller    30
jack      45
dtype: int64

In [27]:
# delete a row in the series
del grades['smith']
grades

john      49
miller    30
jack      45
dtype: int64

In [28]:
grades = pd.Series([49,200,30,45,48,42,39], index=['john','smith','miller','jack','mary','linda','lisa'])
grades

john       49
smith     200
miller     30
jack       45
mary       48
linda      42
lisa       39
dtype: int64

In [29]:
# slice data (start:end:stride)
grades[0:4:2]

john      49
miller    30
dtype: int64

In [30]:
grades[::-1]

lisa       39
linda      42
mary       48
jack       45
miller     30
smith     200
john       49
dtype: int64

In [31]:
grades[4::-1]

mary       48
jack       45
miller     30
smith     200
john       49
dtype: int64

In [32]:
# slice using label index
grades['smith':'linda']

smith     200
miller     30
jack       45
mary       48
linda      42
dtype: int64

# Create DataFrame Object

In [33]:
Sales = pd.Series([200,300,400,500], index=['MicroSoft','Google','Yahoo','Facebook'])
Sales

MicroSoft    200
Google       300
Yahoo        400
Facebook     500
dtype: int64

Convert series Sales into a dataframe with a column name.

In [34]:
df1 = pd.DataFrame({2017 : Sales})
df1

           2017
MicroSoft   200
Google      300
Yahoo       400
Facebook    500

In [35]:
Sales2 = pd.Series([150,250,350,450], index=['MicroSoft','Google','Yahoo','Facebook'])
Sales2

MicroSoft    150
Google       250
Yahoo        350
Facebook     450
dtype: int64

In [36]:
Sales3 = pd.Series([100,200,300,400], index=['MicroSoft','Google','Yahoo','Facebook'])
Sales3

MicroSoft    100
Google       200
Yahoo        300
Facebook     400
dtype: int64

In [37]:
df2 = pd.DataFrame({2016: Sales, 2017: Sales2, 2018: Sales3})
df2

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [38]:
df2.shape

(4, 3)

In [39]:
df2.index.values

array(['MicroSoft', 'Google', 'Yahoo', 'Facebook'], dtype=object)

In [40]:
df2.index.dtype

dtype('O')

In [41]:
df2.columns = ['A','B','C']
df2

             A    B    C
MicroSoft  200  150  100
Google     300  250  200
Yahoo      400  350  300
Facebook   500  450  400

In [42]:
df2.index = ['MS', 'G', 'Y', 'FB']

In [43]:
df2

      A    B    C
MS  200  150  100
G   300  250  200
Y   400  350  300
FB  500  450  400

In [44]:
df2 = pd.DataFrame({2016: Sales, 2017: Sales2, 2018: Sales3})
df2

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

## Operation on The DataFrame Columns

In [45]:
Sales1 = pd.Series([200,300,400,500], index=['MicroSoft','Google','Yahoo','Facebook'])
Sales1

MicroSoft    200
Google       300
Yahoo        400
Facebook     500
dtype: int64

In [46]:
Sales2 = pd.Series([150,250,350,450], index=['MicroSoft','Google','Yahoo','Facebook'])
Sales3 = pd.Series([100,200,300,400], index=['MicroSoft','Google','Yahoo','Facebook'])

In [47]:
df = pd.DataFrame({2016: Sales1, 2017: Sales2, 2018: Sales3})
df

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [48]:
df[[2016, 2017]]

           2016  2017
MicroSoft   200   150
Google      300   250
Yahoo       400   350
Facebook    500   450

In [49]:
# Accessing columns and rows
df[[2016,2017]].head(3)

           2016  2017
MicroSoft   200   150
Google      300   250
Yahoo       400   350

To get specific rows, use **.take** method.

In [50]:
df[[2016,2017]].take([0,2])

           2016  2017
MicroSoft   200   150
Yahoo       400   350

Single square brackets makes the output a series object. Double square brackets returns a DataFrame.

In [51]:
type(df[2017].head(3))

pandas.core.series.Series

In [52]:
df.columns = ['A','B','C']
df

             A    B    C
MicroSoft  200  150  100
Google     300  250  200
Yahoo      400  350  300
Facebook   500  450  400

In [53]:
df.A # or df['A']

MicroSoft    200
Google       300
Yahoo        400
Facebook     500
Name: A, dtype: int64

In [54]:
v1 = df.columns.get_loc('C')
v1

2

## Selecting Rows and Scalar lookup

In [62]:
df = pd.DataFrame({2016: Sales1, 2017: Sales2, 2018: Sales3})
df

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [67]:
df.loc[['MicroSoft','Google']]

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200

In [68]:
df.iloc[[0,1]]

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200

In [69]:
d_f2 = pd.DataFrame({'A':Sales1, 'B':Sales2, 'C':Sales3})
d_f2

             A    B    C
MicroSoft  200  150  100
Google     300  250  200
Yahoo      400  350  300
Facebook   500  450  400

In [70]:
np.any(d_f2.A > 300)

True

In [71]:
d_f2[d_f2.A > 300]

            A    B    C
Yahoo     400  350  300
Facebook  500  450  400

In [72]:
df.at['Google',2016]

300

In [73]:
df

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [74]:
df.iat[0,2]

100

## Modifying DataFrame

In [75]:
df

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [76]:
new_df = df.rename(columns = {2016 : 2015})

In [77]:
new_df

           2015  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [78]:
df.rename(columns={2016 : 2015}, inplace = True)

In [79]:
df.columns

Int64Index([2015, 2017, 2018], dtype='int64')

In [80]:
df [2013] = ([50,70,90,110])

In [81]:
df

           2015  2017  2018  2013
MicroSoft   200   150   100    50
Google      300   250   200    70
Yahoo       400   350   300    90
Facebook    500   450   400   110

In [82]:
df1 = pd.DataFrame({2016: Sales1, 2017: Sales2, 2018: Sales3, 2013: [40,50,60,70]})
df1

           2016  2017  2018  2013
MicroSoft   200   150   100    40
Google      300   250   200    50
Yahoo       400   350   300    60
Facebook    500   450   400    70

Insert column at particular position.

In [83]:
df1.insert(3, 2008,[20,30,40,50])

In [84]:
df1

           2016  2017  2018  2008  2013
MicroSoft   200   150   100    20    40
Google      300   250   200    30    50
Yahoo       400   350   300    40    60
Facebook    500   450   400    50    70

In [85]:
df1.columns = ['A','B','C','D','E']
df1

             A    B    C   D   E
MicroSoft  200  150  100  20  40
Google     300  250  200  30  50
Yahoo      400  350  300  40  60
Facebook   500  450  400  50  70

In [86]:
df1.A = df1.B / 2
df1

               A    B    C   D   E
MicroSoft   75.0  150  100  20  40
Google     125.0  250  200  30  50
Yahoo      175.0  350  300  40  60
Facebook   225.0  450  400  50  70

In [87]:
del df1['A']

In [88]:
df1

             B    C   D   E
MicroSoft  150  100  20  40
Google     250  200  30  50
Yahoo      350  300  40  60
Facebook   450  400  50  70

In [89]:
pop_method = df1.pop('B')

In [90]:
df1

             C   D   E
MicroSoft  100  20  40
Google     200  30  50
Yahoo      300  40  60
Facebook   400  50  70

In [91]:
pop_method

MicroSoft    150
Google       250
Yahoo        350
Facebook     450
Name: B, dtype: int64

In [92]:
drop_method = df1.drop(['D'], axis=1)

In [93]:
df1

             C   D   E
MicroSoft  100  20  40
Google     200  30  50
Yahoo      300  40  60
Facebook   400  50  70

In [94]:
drop_method

             C   E
MicroSoft  100  40
Google     200  50
Yahoo      300  60
Facebook   400  70

 ## Joining DataFrames

In [95]:
Sales4 = pd.Series([150,200,250,60], index=['Amazon','Ebay','Tesla', 'Facebook'])
Sales5 = pd.Series([500,550,600,100], index=['Amazon','Ebay','Tesla', 'Facebook'])
Sales6 = pd.Series([700,750,800,150], index=['Amazon','Ebay','Tesla', 'Facebook'])

d_f2 = pd.DataFrame({2016: Sales4, 2017: Sales5, 2018: Sales6})
d_f2

          2016  2017  2018
Amazon     150   500   700
Ebay       200   550   750
Tesla      250   600   800
Facebook    60   100   150

In [96]:
df1 = pd.DataFrame({2016: Sales1, 2017: Sales2, 2018: Sales3})
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [97]:
# using append
app1 = df1.append(df2)

In [98]:
app1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [99]:
df2 = pd.DataFrame({2013: Sales4, 2014: Sales5, 2015: Sales6})

In [100]:
app2 = df1.append(df2)

In [101]:
app2

            2013   2014   2015   2016   2017   2018
MicroSoft    NaN    NaN    NaN  200.0  150.0  100.0
Google       NaN    NaN    NaN  300.0  250.0  200.0
Yahoo        NaN    NaN    NaN  400.0  350.0  300.0
Facebook     NaN    NaN    NaN  500.0  450.0  400.0
Amazon     150.0  500.0  700.0    NaN    NaN    NaN
Ebay       200.0  550.0  750.0    NaN    NaN    NaN
Tesla      250.0  600.0  800.0    NaN    NaN    NaN
Facebook    60.0  100.0  150.0    NaN    NaN    NaN

In [102]:
df1.loc['Tata'] = [70,90,120]
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400
Tata         70    90   120

In [103]:
df1.at['Google',2018] = 250

In [104]:
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   250
Yahoo       400   350   300
Facebook    500   450   400
Tata         70    90   120

In [105]:
yahoo_pos = df1.index.get_loc('Yahoo')
fif_pos = df1.columns.get_loc(2016)
df1.iloc[yahoo_pos, fif_pos] = 330
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   250
Yahoo       330   350   300
Facebook    500   450   400
Tata         70    90   120

## Arithmetic Operations on DataFrame

In [106]:
df1 = pd.DataFrame({2016: Sales1, 2017: Sales2, 2018: Sales3})
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [107]:
v1 = df1.iloc[0]
v1

2016    200
2017    150
2018    100
Name: MicroSoft, dtype: int64

In [108]:
# row wise broadcast
d1 = df1 - v1
d1

           2016  2017  2018
MicroSoft     0     0     0
Google      100   100   100
Yahoo       200   200   200
Facebook    300   300   300

In [109]:
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [110]:
df1

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200
Yahoo       400   350   300
Facebook    500   450   400

In [111]:
df2 = df1[0:2]
df2

           2016  2017  2018
MicroSoft   200   150   100
Google      300   250   200

In [112]:
df1 + df2

            2016   2017   2018
Facebook     NaN    NaN    NaN
Google     600.0  500.0  400.0
MicroSoft  400.0  300.0  200.0
Yahoo        NaN    NaN    NaN

In [113]:
df3 = df1[0:2] [[2016]]
df3

           2016
MicroSoft   200
Google      300

In [114]:
df1 + df3

            2016  2017  2018
Facebook     NaN   NaN   NaN
Google     600.0   NaN   NaN
MicroSoft  400.0   NaN   NaN
Yahoo        NaN   NaN   NaN